//先ずは文字列を見てみよう！3行目のコードをコメントアウトしてコンソールで確認してみて下さい！

console.log("5");

//次に数値を見てみよう！7行目のコードをコメントアウトしてコンソールで確認してみて下さい！

console.log(5);

/*両方出力は５になっているよね？でも２行目のコードが文字列で4行目のコードが数値で出力されているんだ！
このように、出力結果が同じでも型が違うこともあるから注意してね！*/


//次に計算を見てみよう！15行目のコードをコメントアウトしてコンソールで確認してみて下さい！

console.log("5+10");


/*15行目のコードを実行して、コンソールで確認したら5+10がそのまま出力さてしまったと思います。
これは文字列と認識されてしまってるからです。
では、次は22行目のコードをコメントアウトしてコンソールで「15」としっかり計算がされている事を確認してみて下さい！*/

console.log(5+10);


/*では次に、29行目〜41行目のコードを順番にコメントアウトして出力がどうなるのかの確認をしてみて下さい！
ちなみに30,32,34行目のように+を使うと文字列の連結も出来ます。*/


console.log('こんばんは'+'マリリンモンロー');

console.log('おはよう'+'今日の'+'調子はどうだい？');

console.log('5'+'6');

console.log(5-8);

console.log(10-3);

console.log(20-100+350-420+300);

console.log('＼'+'~'+'o'+'~'+'/');


/*最後に、実際にコードを書いてみましょう！今年の西暦の数字 - あなたの生まれた西暦の数字
というように入力し年齢を出力して下さい。（この下に記述して下さい！）*/
console.log(2026-1997);