<!DOCTYPE html>
<html lang="ja">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>PHP1-3</title>
</head>
<body>
<div class="m-5">
<button onclick="history.back()">chapter4メニュー画面に戻る</button>

<?php
     /*
      課題：
        - 以下のコメントに従いコードを記述してください！
            ※各設問の回答の最後には改行を入れましょう。
            <br>タグをHTMLとして出力することで改行ができます。
        - このファイルをWebブラウザで開き、問題が無ければ保存して、このファイルを提出してください。
        dockerのlesoon4-phpコンテナを起動　→　http://localhost:8000/　にアクセス　→　該当のリンクをクリック　→　結果を確認
    */


    // 1. if文を用いて、$xが100より大きい場合に、’変数xは100より大きいです’ と出力して下さい
        $x = 120;

        if ($x > 100) {
        echo '変数xは100より大きいです<br>';}


    // 2. if-else文を用いて、$xが10以上の場合は、’変数xは10以上です’$xが10より小さい場合は、’変数xは10より小さい’と出力して下さい。
    $x = 5;
    if ($x >= 10) {
        echo '変数xは10以上です<br>';
    } else {
        echo '変数xは10より小さい<br>';
    }

    /*
    3. if-elseif-else文を用いて、以下の条件を満たすコードを書いてください。
        $xが3の倍数の場合は '変数xは3の倍数ですが、7の倍数ではありません'
        $xが7の倍数の場合は '変数xは7の倍数ですが、3の倍数ではありません'
        $xが3の倍数かつ7の倍数の場合は '変数xは3の倍数かつ7の倍数です。'
        それ以外の場合は 'xは7の倍数でも3の倍数でもありません。'
        と出力する
    */
    $x = 21;
if ($x % 3 == 0 && $x % 7 == 0) {
    echo '変数xは3の倍数かつ7の倍数です。<br>';
} elseif ($x % 3 == 0) {
    echo '変数xは3の倍数ですが、7の倍数ではありません<br>';
} elseif ($x % 7 == 0) {
    echo '変数xは7の倍数ですが、3の倍数ではありません<br>';
} else {
    echo 'xは7の倍数でも3の倍数でもありません。<br>';
}

    /*
    4. switch文を用いて、以下の条件を満たすコードを書いてください。
        $xが4の倍数の場合は '変数xは4の倍数ですが、7の倍数ではありません'
        $xが7の倍数の場合は '変数xは7の倍数ですが、4の倍数ではありません'
        $xが4の倍数かつ7の倍数の場合は '変数xは4の倍数かつ7の倍数です。'
        それ以外の場合は 'xは7の倍数でも4の倍数でもありません。'
        と出力する
    */
    $x = 28;

switch (true) {
    case ($x % 4 == 0 && $x % 7 == 0):
        echo '変数xは4の倍数かつ7の倍数です。<br>';
        break;

    case ($x % 4 == 0):
        echo '変数xは4の倍数ですが、7の倍数ではありません<br>';
        break;

    case ($x % 7 == 0):
        echo '変数xは7の倍数ですが、4の倍数ではありません<br>';
        break;

    default:
        echo 'xは7の倍数でも4の倍数でもありません。<br>';
        break;
}
        

?>
</div>
</body>
</html>